package com.company.HomeWork.TwoWork;

public class Les_9 {
    public static void main(String[] args) {
//         2) Напишите программу вывода всех чётных чисел от 2 до 100 включительно
        int i = 1;
        while (i <= 100) {
            if (i % 2 == 0) System.out.println(i);
            i++;
        }
    }
}
